
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7354964878)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * google_secret_manager_secret.bakatare_discord_bot_token
  * google_secret_manager_secret_iam_member.bakatare_discord_bot_token_accessor
* Replace
  * google_compute_instance.minecraft


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_instance.minecraft must be replaced
-/+ resource "google_compute_instance" "minecraft" {
      ~ cpu_platform              = "Ampere Altra" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      ~ effective_labels          = {} -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/bakatare-minecraft/zones/us-central1-a/instances/minecraft" -> (known after apply)
      ~ instance_id               = "1122388980376256540" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
      ~ metadata_fingerprint      = "YtGNVRpV6xM=" -> (known after apply)
      ~ metadata_startup_script   = <<-EOT # forces replacement
          - # 新しいディスクを確認し、存在する場合はフォーマットしてマウントする!!
          + # 新しいディスクを確認し、存在する場合はフォーマットしてマウントする!!!
            DISK="/dev/disk/by-id/google-minecraft"
            MOUNT_POINT="/mnt/stateful_partition/minecraft"
            FS_TYPE="ext4"
            
            # マウントポイントを作成
            mkdir -p "${MOUNT_POINT}"
            
            # ディスクがフォーマットされているか確認
            if ! blkid "${DISK}" > /dev/null 2>&1; then
                echo "Formatting disk ${DISK}"
                # ディスクをフォーマット
                mkfs.ext4 -F "${DISK}"
            fi
            
            # ディスクをマウント
            echo "Mounting disk ${DISK} at ${MOUNT_POINT}"
            mount -t "${FS_TYPE}" "${DISK}" "${MOUNT_POINT}"
            
            # 自動マウントの設定
            if ! grep -qs "${MOUNT_POINT} " /etc/fstab; then
                echo "Adding ${MOUNT_POINT} to /etc/fstab"
                echo "${DISK} ${MOUNT_POINT} ${FS_TYPE} defaults 0 2" >> /etc/fstab
            fi
            
            git clone https://github.com/naari3/bakatare-minna ~/bakatare-minna
            cd ~/bakatare-minna/docker
            docker comopse up -d
        EOT
      + min_cpu_platform          = (known after apply)
        name                      = "minecraft"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/zones/us-central1-a/instances/minecraft" -> (known after apply)
        tags                      = [
            "minecraft",
        ]
      ~ tags_fingerprint          = "YTzQcRKKkWU=" -> (known after apply)
      ~ terraform_labels          = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ attached_disk {
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/zones/us-central1-a/disks/world-data" -> "projects/bakatare-minecraft/zones/us-central1-a/disks/world-data"
            # (2 unchanged attributes hidden)
        }

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/zones/us-central1-a/disks/minecraft" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ labels                = {} -> (known after apply)
              - resource_manager_tags = {} -> null
                # (3 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/networks/minecraft" -> "minecraft"
          ~ network_ip                  = "10.128.0.9" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/regions/us-central1/subnetworks/minecraft" -> (known after apply)
          ~ subnetwork_project          = "bakatare-minecraft" -> (known after apply)

          ~ access_config {
              ~ network_tier = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
          + provisioning_model  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.bakatare_discord_bot_token will be created
  + resource "google_secret_manager_secret" "bakatare_discord_bot_token" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "bakatare-minecraft"
      + secret_id             = "bakatare-discord-bot-token"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.bakatare_discord_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "bakatare_discord_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:bakatare@bakatare-minecraft.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"329d0db818824a89fb61f810cb5c010d32717c6c","Target":"terraform","Vars":{},"WorkflowName":"test"} -->